app/controllers/attachments_controller.rb

SELECT "attachments".* FROM "attachments"
---
  def index
    @attachments = Attachment.all