app/controllers/buildings_controller.rb

INSERT INTO "buildings" ("address", "city", "created_at", "name", "space_type", "state", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @building = Building.new(building_params)

    if @building.save

SELECT  "buildings".* FROM "buildings"  WHERE "buildings"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "buildings" SET "area" = ?, "description" = ?, "updated_at" = ?, "zipcode" = ? WHERE "buildings"."id" = 2  [["area", 50000], ["description", "Office building in Seattle"], ["updated_at", "2014-07-30 23:04:41.818295"], ["zipcode", 97214]]
---
  def update
    @building = Building.find(params[:id])

    if @building.update(building_params)