app/controllers/equipment_controller.rb

  def index
    @equipment = Equipment.all
---
SELECT "equipment".* FROM "equipment"

  def create
    @equipment = Equipment.new(equipment_params)

    if @equipment.save
---
INSERT INTO "equipment" ("building_id", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?)  [["building_id", 2], ["created_at", "2014-07-30 22:50:18.160313"], ["name", "RTU 1"], ["updated_at", "2014-07-30 22:50:18.160313"]]

  def update
    @equipment = Equipment.find(params[:id])

    if @equipment.update(equipment_params)
---
SELECT  "equipment".* FROM "equipment"  WHERE "equipment"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "equipment" SET "location" = $1, "updated_at" = $2 WHERE "equipment"."id" = 1  [["location", "SE rooftop"], ["updated_at", "2014-05-09 01:05:39.774645"]]