app/controllers/session_controller.rb

  def create
    user = User.where("email = ?", params[:email]).first
---
SELECT  "users".* FROM "users"  WHERE (email = 'chadtmiller15@gmail.com')  ORDER BY "users"."id" ASC LIMIT 1