app/controllers/spaces_controller.rb

  def create
    @space = Space.new(space_params)

    if @space.save
---
INSERT INTO "spaces" ("area", "building_id", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["area", 300], ["building_id", 2], ["created_at", "2014-07-30 23:11:16.485424"], ["name", "Conf Rm 225"], ["updated_at", "2014-07-30 23:11:16.485424"]]

  def update
    @space = Space.find(params[:id])

    if @space.update(space_params)
---
SELECT  "spaces".* FROM "spaces"  WHERE "spaces"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "spaces" SET "area" = ?, "updated_at" = ? WHERE "spaces"."id" = 1  [["area", 10281], ["updated_at", "2014-07-30 14:07:27.860042"]]